app/views/profiles/alluser.html.erb

SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 2]]
---
										<div class="col-sm-4 text-center">
											<p><%= alluser.tweets.count %></p>

SELECT  "followings".* FROM "followings" WHERE "followings"."leader_id" = ? AND "followings"."follower_id" = ? LIMIT ?  [["leader_id", 2], ["follower_id", 2], ["LIMIT", 1]]
---
							<%= link_to "View", user_path(id: alluser.id), class:"btn btn-info" %>
							<% if @followin = Following.find_by(leader_id: alluser.id, follower_id: current_user.id) %>