app/views/tweets/_likeajax.html.erb

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."tweet_id" = ? LIMIT ?  [["user_id", 2], ["tweet_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
<% @lik = Like.find_by(user_id: current_user.id, tweet_id: twee.id) %>
<% @userid = Tweet.find(twee.id).likes.pluck(:user_id) %>
<% @userswholiked = User.where(id: @userid) %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."tweet_id" = ?  [["tweet_id", 1]]
---
        <span class="glyphicon glyphicon-star-empty" aria-hidden="true"></span>
        <%= twee.likes.count %>