app/views/tweets/index.html.erb

SELECT  "followings".* FROM "followings" WHERE "followings"."leader_id" = ? AND "followings"."follower_id" = ? LIMIT ?  [["leader_id", 2], ["follower_id", 3], ["LIMIT", 1]]
---

                              <% if @followin = Following.find_by(leader_id: alluser.id, follower_id: current_user.id) %>