app/views/devise/sessions/new.html.erb

SELECT "tweets".* FROM "tweets"
---
<center><h3> It's Twitter Time! </h3></center>
  <% Tweet.all.each do |twee| %>