app/controllers/followings_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "followings" ("leader_id", "follower_id") VALUES (?, ?)  [["leader_id", 2], ["follower_id", 3]]
---
	def create
		@user = User.find(params[:user_id])
		@followin = Following.new
		@followin.follower_id = current_user.id
		@followin.leader_id = @user.id
		@followin.save

SELECT  "followings".* FROM "followings" WHERE "followings"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "followings" WHERE "followings"."id" = ?  [["id", 8]]
---
	def destroy
		@followin = Following.find(params[:id])
		@followin.destroy