app/controllers/likes_controller.rb

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "tweet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["tweet_id", 6], ["created_at", "2017-09-30 07:50:36.750981"], ["updated_at", "2017-09-30 07:50:36.750981"]]
---
	def create
		@twee = Tweet.find(params[:tweet_id])
		@lik = Like.new
		@lik.user_id = current_user.id
		@lik.tweet_id = @twee.id

		if @lik.save

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
	def destroy
		@twee = Tweet.find(params[:tweet_id])
		@lik = Like.find(params[:id])
		if @lik.destroy