app/controllers/profiles_controller.rb

	def alluser
		@allprofile = User.all
---
SELECT "users".* FROM "users"