app/controllers/replies_controller.rb

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "replies" ("post", "user_id", "tweet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["post", "Obama Out"], ["user_id", 3], ["tweet_id", 1], ["created_at", "2017-09-30 07:47:02.448740"], ["updated_at", "2017-09-30 07:47:02.448740"]]
---
	def create
		@twee = Tweet.find(params[:tweet_id])
		repli_params = params.require(:reply).permit(:post)
		@repli = @twee.replies.build(repli_params)
		@repli.user_id = current_user.id
		@repli.tweet_id = @twee.id
		if @repli.save