app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" IN (SELECT "users"."id" FROM "users" WHERE "users"."id" IN (5, 2)) ORDER BY "tweets"."created_at" DESC
---
  	def find_tweet
		@twee = Tweet.find(params[:id])

SELECT "tweets".* FROM "tweets"
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" IN (2, 3) ORDER BY "tweets"."created_at" DESC
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE 1=0
SELECT "likes"."user_id" FROM "likes" WHERE "likes"."tweet_id" = ?  [["tweet_id", 12]]
SELECT "followings"."leader_id" FROM "followings" WHERE "followings"."follower_id" = ?  [["follower_id", 1]]
---
	def index
		@user = current_user
		@newtwee = Tweet.new
		@twee = Tweet.all
		@lik = Like.all
		@user = current_user
		@lid = (@user.leaders.pluck(:leader_id) << @user.id)
		@leadertweet = Tweet.where(user_id: @lid)

		@tweecount = @user.tweets.count
		@leadercount = @user.leaders.count
		@followercount = @user.followers.count
		@allprofile = User.all
		@newtofollow = @allprofile.where.not(id: @user.id)

		@lik = Like.all
		@culikedtweets = @lik.where(user_id: current_user.id).pluck(:tweet_id)
		@userswholikedthesametweets = @lik.where(tweet_id: @culikedtweets).pluck(:user_id)
		@tweetsrec = Tweet.where(user_id: @userswholikedthesametweets)

		@followers = Following.where(follower_id: current_user.id)
		@leaders = @followers.pluck(:leader_id)

INSERT INTO "tweets" ("post", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post", "What's on in politics today?"], ["user_id", 2], ["created_at", "2017-09-30 07:31:58.682179"], ["updated_at", "2017-09-30 07:31:58.682179"]]
---
	def create
		# post_params = params[:tweet].permit(:post)
		@twee = Tweet.new(post_params)
		@twee.user_id = current_user.id

		if @twee.save

SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."tweet_id" = ? LIMIT ?  [["user_id", 2], ["tweet_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."tweet_id" = ?  [["tweet_id", 1]]
---
	def show
		@twee = Tweet.find(params[:id])
		@repli = Reply.new

		@lik = Like.find_by(user_id: current_user.id, tweet_id: @twee.id)
		@likcount = Like.where(tweet_id: @twee.id).count

UPDATE "tweets" SET "post" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["post", "@ppg And they come just in time.."], ["updated_at", "2017-10-01 13:36:57.806912"], ["id", 11]]
---
	def update
		# post_params = params.require(:tweet).permit(:post)
		@twee = Tweet.find(params[:id])
		if @twee.update(post_params)